{
  "architectures": [
    "Gemma3ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attn_logit_softcapping": null,
  "bos_token_id": 2,
  "cache_implementation": "hybrid",
  "eos_token_id": 1,
  "final_logit_softcapping": null,
  "head_dim": 8,
  "hidden_activation": "gelu_pytorch_tanh",
  "hidden_size": 16,
  "initializer_range": 0.02,
  "intermediate_size": 32,
  "max_position_embeddings": 32,
  "model_type": "gemma3_text",
  "num_attention_heads": 4,
  "num_hidden_layers": 6,
  "num_key_value_heads": 1,
  "pad_token_id": 0,
  "query_pre_attn_scalar": 8,
  "rms_norm_eps": 1e-06,
  "rope_local_base_freq": 10000.0,
  "rope_scaling": null,
  "rope_theta": 1000000.0,
  "sliding_window": 4,
  "sliding_window_pattern": 3,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "use_cache": false,
  "vocab_size": 65,
  "a2d": {
    "objective": "mdlm",
    "mask_token_id": 64,
    "final_alpha": 0.5,
    "sampler": {
      "canvas_len": 8,
      "num_steps": 8,
      "temperature": 1.0
    }
  }
}
