{
  "added_tokens_decoder": {
    "0": {
      "content": "<eos>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "64": {
      "content": "<|mdlm_mask|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "clean_up_tokenization_spaces": false,
  "eos_token": "<eos>",
  "extra_special_tokens": {},
  "mask_token": "<|mdlm_mask|>",
  "model_max_length": 1000000000000000019884624838656,
  "tokenizer_class": "PreTrainedTokenizer"
}
